# Data Cleaning Assignment

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [ ]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [ ]:
l = df['FlightNumber'].size
for i in range(0,l):
    if i == 0:
        continue
    df['FlightNumber'][i] = ( (df['FlightNumber'][i-1]) +10 )

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [ ]:
df['FlightNumber'] = df['FlightNumber'].astype(int)

In [ ]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [ ]:
newCol = df['From_To'].str.split('_',expand=True)
df['From'] = newCol[0]
df['To'] = newCol[1]

In [ ]:
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    LoNDon      paris
1      MAdrid_miLAN         10055  ...    MAdrid      miLAN
2  londON_StockhOlm         10065  ...    londON  StockhOlm
3    Budapest_PaRis         10075  ...  Budapest      PaRis
4   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [ ]:
df['From'] = df['From'].str.lower()
df['From'] = df['From'].str.capitalize()

In [ ]:
df['To'] = df['To'].str.lower()
df['To'] = df['To'].str.capitalize()

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [ ]:
del(df['From_To'])

In [ ]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

In [ ]:
RD = df['RecentDelays'].apply(pd.Series)

In [ ]:
RD

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [ ]:
RD = RD.rename(columns = lambda x : 'RD_' + str(x))

In [ ]:
RD

   RD_0  RD_1  RD_2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [ ]:
pd.concat( [ df[:] ,RD[:] ],axis=1  )

   FlightNumber  RecentDelays              Airline  ...  RD_0  RD_1  RD_2
0         10045      [23, 47]               KLM(!)  ...  23.0  47.0   NaN
1         10055            []    <Air France> (12)  ...   NaN   NaN   NaN
2         10065  [24, 43, 87]  (British Airways. )  ...  24.0  43.0  87.0
3         10075          [13]       12. Air France  ...  13.0   NaN   NaN
4         10085      [67, 32]          "Swiss Air"  ...  67.0  32.0   NaN

[5 rows x 8 columns]